In [100]:
import numpy as np

In [101]:
a = np.array([1, 2,3,4,5])

In [102]:
a

array([1, 2, 3, 4, 5])

In [103]:
a.ndim

1

A series is a one dimensional array. A column in a dataset can be considered as a series.

In [104]:
names = ["Felihle", "Sandra", "Faith", "Delali", "Justice", "Delphine"]

In [105]:
import pandas as pd

In [106]:
series = pd.Series(names)

In [107]:
series

0     Felihle
1      Sandra
2       Faith
3      Delali
4     Justice
5    Delphine
dtype: object

In [108]:
series[4]

'Justice'

In [109]:
labels = ["a", "b", "c", "d", "e", "f"]

In [110]:
s = pd.Series(names, index=labels)

In [111]:
s

a     Felihle
b      Sandra
c       Faith
d      Delali
e     Justice
f    Delphine
dtype: object

In [112]:
s['e']

'Justice'

You can only use loc when dealing with index labels. It does not hold for integer positions.

In [113]:
s.loc['b']

'Sandra'

In [114]:
s.loc['b':'e']

b     Sandra
c      Faith
d     Delali
e    Justice
dtype: object

In [115]:
s['b':'e']

b     Sandra
c      Faith
d     Delali
e    Justice
dtype: object

In [116]:
s.loc['a':'c':2]

a    Felihle
c      Faith
dtype: object

In [117]:
s['a':'c':2]

a    Felihle
c      Faith
dtype: object

`.loc` is a method used to extract content from data using labels.

In [118]:
s.iloc[1]

'Sandra'

`.iloc` is similar to `.loc`, but uses integer positions.

- In `.loc`, the upper bound is included.
- In `.iloc`, the upper bound is not included.

In [119]:
s.iloc[0:2]

a    Felihle
b     Sandra
dtype: object

# Assignment

Slide 21

## Creating Dataframes

In [120]:
pd.DataFrame(s)

          0
a   Felihle
b    Sandra
c     Faith
d    Delali
e   Justice
f  Delphine

In [121]:
pd.DataFrame(series)

          0
0   Felihle
1    Sandra
2     Faith
3    Delali
4   Justice
5  Delphine

In [122]:
id = [10001, 20003, 48900, 12367]

In [123]:
names = ['Felihle', 'Sandra', 'Faith', 'Delali']

In [124]:
len(id) == len(names)

True

In [125]:
df = pd.DataFrame({'ID_Numbers': id})

In [126]:
df

   ID_Numbers
0       10001
1       20003
2       48900
3       12367

In [127]:
df = pd.DataFrame({'Names': names})

In [128]:
df

     Names
0  Felihle
1   Sandra
2    Faith
3   Delali

In [129]:
df = pd.DataFrame({'ID_Numbers': id, 'Names': names})

In [130]:
df

   ID_Numbers    Names
0       10001  Felihle
1       20003   Sandra
2       48900    Faith
3       12367   Delali

In [131]:
df.shape

(4, 2)

In [132]:
data = [
    [101, 'Felihle'],
    [202, 'Sandra'],
    [203, 'Faith'],
    [401, 'Delali'],
]

In [133]:
data

[[101, 'Felihle'], [202, 'Sandra'], [203, 'Faith'], [401, 'Delali']]

In [134]:
df = pd.DataFrame(data, columns=["ID_Number", "Names"])

In [135]:
df

   ID_Number    Names
0        101  Felihle
1        202   Sandra
2        203    Faith
3        401   Delali

In [136]:
# Check rows and columns

df.shape

(4, 2)

## How to extract data from a dataframe

In [137]:
df.iloc[0:2]

   ID_Number    Names
0        101  Felihle
1        202   Sandra

In [138]:
df.iloc[0:2,1]

0    Felihle
1     Sandra
Name: Names, dtype: object

In [139]:
df.iloc[0:2,0]

0    101
1    202
Name: ID_Number, dtype: int64

In [140]:
df.loc[0:1, 'Names']

0    Felihle
1     Sandra
Name: Names, dtype: object

In [141]:
df.iloc[0:3:2]

   ID_Number    Names
0        101  Felihle
2        203    Faith

In [142]:
df.iloc[0:3:2, 1]

0    Felihle
2      Faith
Name: Names, dtype: object

In [143]:
df.loc[0:2:2]

   ID_Number    Names
0        101  Felihle
2        203    Faith

In [144]:
df.loc[0:2:2, 'Names']

0    Felihle
2      Faith
Name: Names, dtype: object

Creating

In [145]:
df['Age'] = [12, 5, 7, 8]

In [146]:
df

   ID_Number    Names  Age
0        101  Felihle   12
1        202   Sandra    5
2        203    Faith    7
3        401   Delali    8

In [147]:
df['Grades'] = [4.5, 3.2, 4.0, 3.3]

In [148]:
df

   ID_Number    Names  Age  Grades
0        101  Felihle   12     4.5
1        202   Sandra    5     3.2
2        203    Faith    7     4.0
3        401   Delali    8     3.3

Assignment: slide 31